Revit 2026 API

# BuiltInFailuresRebarFailuresInverted3dShape Property

---

**Note: This API is now obsolete.**

The Rebar Shape XX cannot be inverted.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This value is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
public static FailureDefinitionId Inverted3dShape { get; }
```
```vb
<ObsoleteAttribute("This value is deprecated in Revit 2026 and may be removed in a later version of Revit.")>
Public Shared ReadOnly Property Inverted3dShape As FailureDefinitionId
	Get
```
```cpp
public:
[ObsoleteAttribute(L"This value is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
static property FailureDefinitionId^ Inverted3dShape {
	FailureDefinitionId^ get ();
}
```
```fsharp
[<ObsoleteAttribute("This value is deprecated in Revit 2026 and may be removed in a later version of Revit.")>]
static member Inverted3dShape : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId

#### Reference

BuiltInFailuresRebarFailures Class

Autodesk.Revit.DB Namespace